export const BREEDS = [
    "ערבי מערוב קו ",
    "ערבי מצרי",
    "פריזן",
    "קווטר",
    "טורבדריד",
    "סינגל פוט",
    "טנסי",
    "אנדלוסי",
    "אפלוסה",
    "מיזורי פוקס טרוטר",
    "פיינט",
    "פוני",
    "פוני וולש",
    "פוני שטלנד",
    "אחר",
];

export const CATEGORIES = [
    { path: '/horses', label: 'סוסים' },
    { path: '/seeds', label: 'זרע' },
    { path: '/accessories', label: 'אביזרים' },
];

export const EXTENDED_CATEGORIES = [
    ...CATEGORIES,
    { path: '/boarding', label: 'פנסיון' },
    { path: '/exhibitors', label: 'מציגים' },
    { path: '/breeders', label: 'מפרזילים' },
    { path: '/schools', label: 'בתי ספר' },
    { path: '/trips', label: 'טיולים' },
    { path: '/shops', label: 'חנויות' },
    { path: '/shows-and-competitions', label: 'תצוגות ותחריות' },
    { path: '/our-products', label: 'מוצרים שלנו' },
]

export const SEEDS_TYPES = [
    "ערבי מעורב קו",
    "ערבי מצרי",
    "אחר"
];

export const SEMEN_TYPES = [
    "זרע טרי",
    "זרע קפוא"
]

export const ACCESSORIES_TPYES = [
    "קרון",
    "תאים",
    "עמדת בדיקה",
    "מכונת אוכל אוטומטית",
    "אוכפים",
    "קסדות",
    "בגדים לרכיבה",
    "מוצרי רכיבה",
    "אחר"
]

export const DISTRICTS = {
    north: ["רמת הגולן", "ראש פינה ועמק החולה", "גליל עליון", "עכו נהריה והסביבה", " כרמיאל והסביבה", "קריות", "חיפה", "כנרת", "גליל תחתון", "נצרת - שפרעם"],
    hadera: ["יקנעם, טבעון", "עפולה והעמקים", "זכרון יעקב וחוף הכרמל", "קיסריה", "בית שאן", "רמות מנשה", "חדרה"],
    jordan: ["ישובי שומרון", "אריאל וישובי יהודה", "בקעת הירדן, ים המלח", "גוש עציון"],
    sharon: ["נתניה","רעננה וכפר סבא", "הוד השרון", "רמת השרון והרצליה"],
    center: ["ראש העין", "בני ברק וגבעת שמואל", "פתח תקווה", "רמת גן וגבעתיים", "תל אביב יפו", "בקעת אונו", "חולון ובת ים", "שוהם", "ראשון לציון", "רמלה - לוד", "מודיעין"],
    shefla: ["נס ציונה ורחובות", "גדרה - יבנה", "אשדוד, אשקלון", "קרית גת", "השפלה"],
    jerusalem: ["הרי יהודה, מברשת", "ירושלים", "מעלה אדומים", "בית שמש"],
    south: ["באר שבע", "הנגב", "אילת"]
}

export const DISTRICT_NAMES = {
    north: "צפון",
    hadera: "חדרה",
    jordan: "יהודה ושומרון ובקעת הירדן",
    sharon: "שרון",
    center: "מרכז",
    shefla: "שפלה",
    jerusalem: "ירושלים",
    south: "דרום"
};

export const ADS_PER_PAGE = 5;